InformationRegisters/Д_НастройкиШаблоновОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>Д_НастройкиШаблоновОтправки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизвольныйЗапрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>UIDЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Д_ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Д_ТипыЗапросов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВызываемыйМетод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Д_ИдентификаторМетода</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Д_ТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Д_ТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/Д_НастройкиШаблоновОтправки/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СозданоИзФормыОбъекта") Тогда
		
		Если ЗаписьИмеетсяВРегистре() Тогда
			Элементы.ТипОбъекта.ТолькоПросмотр = Истина;
			Элементы.ИмяОбъекта.ТолькоПросмотр = Истина;
		КонецЕсли;
		
		Запись.ТипОбъекта = ?("Документ" = Параметры.ТипДокумента, 
		Перечисления.Д_ТипыОбъектов.Документ, Перечисления.Д_ТипыОбъектов.Справочник);
		Запись.ИмяОбъекта = Параметры.ИмяДокумента;
		Запись.UIDЗаписи = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольныйЗапросПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ГруппаШаблонЗапроса.Видимость = Запись.ПроизвольныйЗапрос;
	
	Если НЕ Запись.ПроизвольныйЗапрос Тогда
		Элементы.СопоставитьПараметры.Видимость = НЕ ПустаяСтрока(Запись.Шаблон);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
	Если НЕ ПустаяСтрока(Запись.Шаблон) Тогда
		ДанныеОбъекта = Новый Структура();
		ДанныеОбъекта.Вставить("ИмяОбъекта", Запись.ИмяОбъекта);
		ДанныеОбъекта.Вставить("ТипОбъекта", Запись.ТипОбъекта);
		Запись.ШаблонЗапроса = Д_ИнтеграцияСJiraВызовСервера.СформироватьСтандартныйШаблонЗапроса(Запись.Шаблон, ДанныеОбъекта);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьПараметры(Команда)
	
	Если НЕ ЗаписьИмеетсяВРегистре() Тогда
		ПоказатьПредупреждение(, "Перед сопоставлением запишите данные!");
	Иначе
		СопоставлениеСсылка = ИмеетсяСопоставление();
		Если СопоставлениеСсылка = ПредопределенноеЗначение("Справочник.Д_СопоставлениеПолейЗапросов.ПустаяСсылка") Тогда
			
			ПараметрыОткрытия = Новый Структура();
			ПараметрыОткрытия.Вставить("UIDЗаписи", Запись.UIDЗаписи);
			ПараметрыОткрытия.Вставить("ТипОбъекта", Запись.ТипОбъекта);
			ПараметрыОткрытия.Вставить("ИмяОбъекта", Запись.ИмяОбъекта);
			ПараметрыОткрытия.Вставить("ШаблонJSON", Запись.Шаблон);
			ПараметрыОткрытия.Вставить("ТипЗапроса", Запись.ТипЗапроса);
			ПараметрыОткрытия.Вставить("ПроизвольныйЗапрос", Запись.ПроизвольныйЗапрос);
			
			ОткрытьФорму("Справочник.Д_СопоставлениеПолейЗапросов.Форма.ФормаЭлемента", ПараметрыОткрытия, 
							ЭтотОбъект,,,,,
							РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		Иначе
			
			ПараметрыОткрытия = Новый Структура();
			ПараметрыОткрытия.Вставить("Ключ", СопоставлениеСсылка);
			ПараметрыОткрытия.Вставить("ПроизвольныйЗапрос", Запись.ПроизвольныйЗапрос);
			ПараметрыОткрытия.Вставить("ТипОбъекта", Запись.ТипОбъекта);
			ПараметрыОткрытия.Вставить("ИмяОбъекта", Запись.ИмяОбъекта);
			
			ОткрытьФорму("Справочник.Д_СопоставлениеПолейЗапросов.Форма.ФормаЭлемента", ПараметрыОткрытия, 
							ЭтотОбъект,,,,,
							РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИмеетсяСопоставление()

	Возврат Справочники.Д_СопоставлениеПолейЗапросов.НайтиПоРеквизиту("GUIDЗаписи", Запись.UIDЗаписи);
	
КонецФункции

&НаСервере
Функция ЗаписьИмеетсяВРегистре()
	
	ЗаписьИмеется = Ложь;
	
	НаборЗаписей = РегистрыСведений.Д_НастройкиШаблоновОтправки.СоздатьНаборЗаписей();		
	НаборЗаписей.Отбор.UIDЗаписи.Установить(Запись.UIDЗаписи);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 1 Тогда
		ЗаписьИмеется = Истина;
	КонецЕсли;
	
	Возврат ЗаписьИмеется;
	
КонецФункции
